Revit 2027 API
StructuralWallUsageFilter.StructuralWallUsage Property
 The wall structural usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralWallUsage StructuralWallUsage { get; }
Public ReadOnly Property StructuralWallUsage As StructuralWallUsage
	Get
public:
property StructuralWallUsage StructuralWallUsage {
	StructuralWallUsage get ();
}
member StructuralWallUsage : StructuralWallUsage with get
Property Value
StructuralWallUsage
See Also
Reference
StructuralWallUsageFilter Class
Autodesk.Revit.DB.Structure Namespace